import "./CSS/Terms.css";

const Policy = () => {
  return (
    <div className="terms-container">
      <h1>წესები და პირობები</h1>
      <p style={{ marginBottom: "20px" }}>
        წესები და პირობები (Terms and Conditions) ბოლო განახლება: 2025 წლის 25
        ივნისი
      </p>

      <p style={{ marginBottom: "20px" }}>
        გთხოვთ, ყურადღებით წაიკითხოთ ეს წესები და პირობები, სანამ ისარგებლებთ
        Easy Way-ს ვებსაიტით და სერვისებით.
      </p>

      <section>
        <h2>1. ზოგადი ინფორმაცია</h2>
        <p>
          საიტი Easy Way წარმოადგენს ფასდაკლების ბარათების სერვისს, რომელიც
          მომხმარებლებს სთავაზობს სპეციალურ შეთავაზებებს პარტნიორ კომპანიებთან.
          Easy Way არ წარმოადგენს უშუალოდ მომსახურების მიმწოდებელს, არამედ
          აკავშირებს მომხმარებელს პარტნიორ ობიექტებთან.
        </p>
      </section>

      <section>
        <h2>2. რეგისტრაცია და ანგარიშის შექმნა</h2>
        <p>
          სერვისით სარგებლობისთვის აუცილებელია ანგარიშის შექმნა. რეგისტრაციისას
          მომხმარებელი ვალდებულია მიაწოდოს ზუსტი და სრული ინფორმაცია და ასევე
          პასუხისმგებელია თავისი ანგარიშის კონფიდენციალურობის დაცვაზე.
          წინააღმდეგ შემთხვევაში EasyWay არ არის პასუხისმგებელი მომხდარ
          შედეგებზე
        </p>
      </section>

      <section>
        <h2>3. ბარათების შეძენა და გადახდის პირობები</h2>
        <p>Easy Way-ის ფასდაკლების ბარათების შეძენა ხდება შემდეგი ვადებით:</p>
        <ul>
          <li>1 თვიანი </li>
          <li>6 თვიანი </li>
          <li>12 თვიანი </li>
        </ul>
        <p>
          გადახდა ხდება მხოლოდ ონლაინ, მოქმედი საბანკო ბარათით. ბარათის შეძენის
          შემდეგ თანხა არ ითვლება დაბრუნებულად.
        </p>
      </section>

      <section>
        <h2>4. ფასდაკლებების პირობები</h2>
        <p>
          ფასდაკლების პროცენტები დამოკიდებულია მომხმარებლის მიერ შეძენილი
          პროდუქციის/მომსახურების ღირებულებაზე:
        </p>
        <ul>
          <li>1-100 ლარამდე — 30% ფასდაკლება</li>
          <li>100-300 ლარამდე — 20% ფასდაკლება</li>
          <li>300 ლარზე მეტი — 10% ფასდაკლება</li>
        </ul>
        <p>ფასდაკლება ვრცელდება მხოლოდ Easy Way-ის პარტნიორ ობიექტებზე.</p>
      </section>

      <section>
        <h2>5. მესამე მხარეები და პასუხისმგებლობის შეზღუდვა</h2>
        <p>
          Easy Way თანამშრომლობს სხვადასხვა ბიზნეს ობიექტთან, თუმცა არ იღებს
          პასუხისმგებლობას მათი მომსახურების ხარისხზე, შეცდომებზე, შეფერხებებსა
          და სხვა დაუგეგმავ შემთხვევებზე.
        </p>
      </section>

      <section>
        <h2>6. პერსონალური მონაცემების დაცვა</h2>
        <p>
          თქვენი პერსონალური მონაცემები (რეგისტრაციის დროს მოწოდებული
          ინფორმაცია) დაცულია Easy Way-ის მიერ და არ გადაეცემა მესამე პირებს
          მომხმარებლის წინასწარი თანხმობის გარეშე, გარდა კანონით
          გათვალისწინებული შემთხვევებისა.
        </p>
      </section>

      <section>
        <h2>ცვლილებები წესებსა და პირობებში</h2>
        <p>
          Easy Way იტოვებს უფლებას ნებისმიერ დროს შეიტანოს ცვლილებები ამ
          დოკუმენტში. ცვლილების ძალაში შესვლის თარიღი მიუთითება წესების თავში.
        </p>
        <p>
          თუ დაეთანხმებით ამ წესებსა და პირობებს, მიიღებთ წვდომას Easy Way-ის
          სერვისებზე. სერვისის გამოყენება ნიშნავს, რომ ეთანხმებით და იცნობთ
          აღნიშნულ პირობებს.
        </p>
      </section>
    </div>
  );
};

export default Policy;
