import "./CSS/Policy.css";

const Policy = () => {
  return (
    <div className="policy-container">
      <h1>კონფიდენციალურობა და პოლიტიკა</h1>
      <p style={{ marginBottom: "20px" }}>
        კონფიდენციალურობის პოლიტიკა (Privacy Policy) ბოლო განახლება: 2025 წლის
        25 ივნისი
      </p>

      <p style={{ marginBottom: "20px" }}>
        მოცემული კონფიდენციალურობის პოლიტიკა განსაზღვრავს, როგორ აგროვებს,
        იყენებს და იცავს Easy Way მომხმარებლის პერსონალურ ინფორმაციას.
      </p>

      <section>
        <h2>
          1. ინფორმაცია, რომელსაც ვაგროვებთ რეგისტრაციისას ან სერვისით
          სარგებლობისას შეიძლება შეგვატყობინოთ შემდეგი მონაცემები:
        </h2>
        <ul>
          <li>სახელი და გვარი</li>
          <li>ელ.ფოსტის მისამართი</li>
          <li>
            გადახდის დეტალები (ბანკის ბარათის ტიპი, მაგრამ არა მისი სრული
            ნომერი)
          </li>
          <li>ვებსაიტზე შესრულებული შეკვეთებისა და ქმედებების ისტორია</li>
          <li>ბარათის პაკეტის არჩევანი</li>
        </ul>
      </section>

      <section>
        <h2>
          2. როგორ ვიყენებთ ამ ინფორმაციას? მომხმარებლის მიერ მოწოდებული
          ინფორმაცია გამოიყენება შემდეგი მიზნებისთვის:
        </h2>
        <ul>
          <li>შეკვეთების დამუშავება და მიწოდება</li>
          <li>სერვისის გაწევა და ბარათის აქტივაცია</li>
          <li>ანგარიშის მართვა და მომხმარებლის იდენტიფიკაცია</li>
          <li>ტექნიკური დახმარების გაწევა</li>
          <li>
            მომხმარებელთან კომუნიკაცია (ელ.ფოსტით, ტელეფონით ან უშუალოდ
            ვებსაიტის ონლაინ ჩატიდან)
          </li>
          <li>გადახდის განხორციელება</li>
          <li>გარიგებების უსაფრთხოდ დამუშავება</li>
          <li>სერვისის გაუმჯობესება და ანალიტიკის მიზნები</li>
        </ul>
      </section>

      <section>
        <h2>3. გადახდის პროცესის ინფორმაცია</h2>
        <p>
          EasyWay არ ახორციელებს მომხმარებლის ბარათის მონაცემების უშუალო
          დამუშავებას
        </p>
      </section>

      <section>
        <h2>4. ინფორმაციის გაზიარება მესამე პირებთან</h2>
        <p>
          Easy Way არ გადასცემს მომხმარებლის ინფორმაციას მესამე პირებს, გარდა იმ
          შემთხვევებისა, როდესაც:
        </p>
        <ul>
          <li>არსებობს მომხმარებლის თანხმობა</li>
          <li>
            საჭიროა სერვისის გაწევისთვის (მაგალითად, პარტნიორი ობიექტის
            დასადასტურებლად)
          </li>
          <li>ამას მოითხოვს მოქმედი კანონმდებლობა ან სასამართლო</li>
        </ul>
      </section>

      <section>
        <h2>
          5. მონაცემების დაცვა Easy Way იღებს გონივრულ ტექნიკურ და ორგანიზაციულ
          ზომებს მომხმარებლის ინფორმაციის დასაცავად:
        </h2>
        <ul>
          <li>დაცული სერვერები</li>
          <li>შეზღუდული წვდომა მომხმარებლის მონაცემებზე</li>
          <li>
            ჩვენ არ ვინახავთ ბარათის სრულ ინფორმაციას (CVV კოდი, სრული ნომერი და
            ა.შ.).
          </li>
          <li>მონაცემების დაშიფვრა</li>
        </ul>
      </section>

      <section>
        <h2>6. მომხმარებლის უფლებები</h2>
        <p>თქვენ გაქვთ უფლება:</p>
        <ul>
          <li>
            მოითხოვოთ ინფორმაცია, თუ როგორ ინახება და გამოიყენება თქვენი
            მონაცემები
          </li>
          <li>მოითხოვოთ მონაცემების წაშლა ან ჩასწორება</li>
          <li>
            უარი თქვათ კონკრეტულ სახის მონაცემების დამუშავებაზე, მაგრამ (ამ
            სახის ქმედებამ შესაძლოა გამოიწვიოს შეზღუდვები საიტის რომელიმე
            ფუნქციონალზე)
          </li>
        </ul>
        <p>
          საკონტაქტო ფორმის მეშვეობით შეგიძლიათ მოგვწეროთ ნებისმიერი მოთხოვნა,
          რომელიც GDPR-ს ან საქართველოს მონაცემთა დაცვის კანონმდებლობას ეხება.
          ან დაგვიკავშირდეთ ნომერზე
          <strong>579 16 14 30</strong>
        </p>
      </section>

      <section>
        <h2>7. ქუქი ფაილები (Cookies)</h2>
        <p>
          Easy Way იყენებს ქუქიებს საიტის ფუნქციონირებისთვის და მომხმარებლის
          გამოცდილების გასაუმჯობესებლად. ქუქიების გამოყენება ავტომატურად არ
          ითვლის პირად იდენტიფიკაციას, მაგრამ შესაძლოა დაკავშირებული იყოს
          ანგარიშთან.
        </p>
      </section>

      <section>
        <h2>8. კონფიდენციალურობის პოლიტიკის ცვლილებები</h2>
        <p>
          ჩვენ შეიძლება დროდადრო განვაახლოთ ეს პოლიტიკა. ყველა ცვლილება ძალაში
          შევა განახლების თარიღიდან და გამოქვეყნდება საიტზე. <br />
          თუ თანხმდებით ამ პოლიტიკას, ნიშნავს, რომ გესმით და ეთანხმებით Easy
          Way-ის მონაცემთა დაცვის პირობებს.
        </p>
      </section>
    </div>
  );
};

export default Policy;
