const Policy = () => {
    return ( 
        <div className="policy-container">
            <p> 1. შეგროვებული ინფორმაცია
            ჩვენ შეგვიძლია შევაგროვოთ შემდეგი მონაცემები მომხმარებლისაგან:
            სახელი და გვარი.
            ელ.ფოსტის მისამართი.
            შენახული ბარათის მონაცემები (მხოლოდ მომხმარებლის სურვილის   შემთხვევაში ავტომატური გადახდებისთვის).
            ვებსაიტზე შესრულებული შეკვეთების და ქმედებების ისტორია.

            2. მონაცემთა გამოყენების მიზანი

            მოცემული მონაცემები გამოიყენება შემდეგი მიზნებისთვის:
            შეკვეთების დამუშავება და მიწოდება.
            გადახდის განხორციელება.
            მომხმარებელთა მხარდაჭერის გაწევა.
            სერვისის გაუმჯობესება და ანალიტიკის მიზნები

            3. გადახდის პროცესის ინფორმაცია

            EasyWay არ ახორციელებს მომხმარებლის ბარათის მონაცემების უშუალო დამუშავებას. გადახდა ხორციელდება საქართველოს ბანკის დაცულ პლატფორმაზე, სადაც მომხმარებელი გადამისამართდება გადახდის გვერდზე. წარმატებული გადახდის შემდეგ, ჩვენ ვინახავთ მხოლოდ იმ მონაცემებს, რომლებიც ბანკიდან გვიბრუნდება (მაგ. ოპერაციის სტატუსი, თანხა, თარიღი და ა.შ.)

            4. მესამე პირებთან გაზიარება
            ჩვენ არ ვუზიარებთ მომხმარებლების მონაცემებს არცერთ მესამე მხარეს

            5. მონაცემთა უსაფრთხოება

            მომხმარებლის მონაცემები ინახება უსაფრთხოდ და არანებართულ პირთათვის მიუწვდომელია. ჩვენ ვიყენებთ შესაბამის ტექნიკურ ზომებს ინფორმაციის დაცვის უზრუნველსაყოფად

            6. მომხმარებლის უფლებები
            მომხმარებელს აქვს უფლება:
            მოითხოვოს საკუთარი მონაცემების ნახვა
            მოითხოვოს მონაცემების გასწორება ან წაშლა
            ამისათვის შეგიძლიათ დაგვიკავშირდეთ შემდეგ ნომერზე: 579 16 14 30

            7.ქუქი ფაილები (Cookies)
            ჩვენ ვიყენებთ ქუქი-ფაილებს მხოლოდ იმისთვის, რომ შევინახოთ მომხმარებლის მონაცემები უკეთესი მომსახურების უზრუნველსაყოფად.
            ქუქი ფაილები არ გადაიცემა მესამე მხარეებთან.

            8.კონფიდენციალურობის პოლიტიკის ცვლილებები
            ნებისმიერი ცვლილებების შემთხვევაში, მომხმარებელი მიიღებს შეტყობინებას ვებსაიტზე ან ელ.ფოსტის საშუალებით
            </p>
        </div>
     );
}
 
export default Policy;